<!-- infrastructure/cluster: do not delete/edit this line -->
#### Terraform Format and Style 🖌\`success\`
#### Terraform Initialization ⚙️\`success\`
#### Terraform Validation 🤖\`success\`
<details><summary>Validation Output</summary>

\`\`\`\n
[32m[1mSuccess![0m The configuration is valid.
[0m

\`\`\`

</details>

#### Terraform Plan 📖\`success\`

<details><summary>Show Plan</summary>

\`\`\`
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/jolfr-personal/data-project-example-cluster/runs/run-Ftf8XC4norAjQXmf

Waiting for the plan to start...

Terraform v1.11.2
on linux_amd64
Initializing plugins and modules...
data.google_client_openid_userinfo.me: Refreshing...
data.google_client_openid_userinfo.me: Refresh complete after 0s [id=hcp-terraform@data-project-example.iam.gserviceaccount.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_container_cluster.main will be created
  + resource "google_container_cluster" "main" {
      + cluster_ipv4_cidr                        = (known after apply)
      + datapath_provider                        = (known after apply)
      + default_max_pods_per_node                = (known after apply)
      + deletion_protection                      = false
      + effective_labels                         = {
          + "goog-terraform-provisioned" = "true"
        }
      + enable_cilium_clusterwide_network_policy = false
      + enable_fqdn_network_policy               = false
      + enable_intranode_visibility              = (known after apply)
      + enable_kubernetes_alpha                  = false
      + enable_l4_ilb_subsetting                 = false
      + enable_legacy_abac                       = false
      + enable_multi_networking                  = false
      + enable_shielded_nodes                    = true
      + endpoint                                 = (known after apply)
      + id                                       = (known after apply)
      + initial_node_count                       = 1
      + label_fingerprint                        = (known after apply)
      + location                                 = "us-central1"
      + logging_service                          = (known after apply)
      + master_version                           = (known after apply)
      + monitoring_service                       = (known after apply)
      + name                                     = "data-project-example-cluster"
      + network                                  = "default"
      + networking_mode                          = (known after apply)
      + node_locations                           = (known after apply)
      + node_version                             = (known after apply)
      + operation                                = (known after apply)
      + private_ipv6_google_access               = (known after apply)
      + project                                  = (known after apply)
      + remove_default_node_pool                 = true
      + self_link                                = (known after apply)
      + services_ipv4_cidr                       = (known after apply)
      + subnetwork                               = (known after apply)
      + terraform_labels                         = {
          + "goog-terraform-provisioned" = "true"
        }
      + tpu_ipv4_cidr_block                      = (known after apply)

      + addons_config (known after apply)

      + authenticator_groups_config (known after apply)

      + cluster_autoscaling (known after apply)

      + confidential_nodes (known after apply)

      + control_plane_endpoints_config (known after apply)

      + cost_management_config (known after apply)

      + database_encryption (known after apply)

      + default_snat_status (known after apply)

      + enterprise_config (known after apply)

      + gateway_api_config (known after apply)

      + identity_service_config (known after apply)

      + ip_allocation_policy (known after apply)

      + logging_config (known after apply)

      + master_auth (known after apply)

      + master_authorized_networks_config (known after apply)

      + mesh_certificates (known after apply)

      + monitoring_config (known after apply)

      + node_config (known after apply)

      + node_pool (known after apply)

      + node_pool_auto_config (known after apply)

      + node_pool_defaults (known after apply)

      + notification_config (known after apply)

      + release_channel (known after apply)

      + security_posture_config (known after apply)

      + service_external_ips_config (known after apply)

      + vertical_pod_autoscaling (known after apply)

      + workload_identity_config (known after apply)
    }

  # google_container_node_pool.general_nodes will be created
  + resource "google_container_node_pool" "general_nodes" {
      + cluster                     = (known after apply)
      + id                          = (known after apply)
      + initial_node_count          = 1
      + instance_group_urls         = (known after apply)
      + location                    = "us-central1"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "data-project-example-gen-np"
      + name_prefix                 = (known after apply)
      + node_count                  = (known after apply)
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = "data-project-example"
      + version                     = (known after apply)

      + autoscaling {
          + location_policy      = (known after apply)
          + total_max_node_count = 10
          + total_min_node_count = 0
        }

      + management (known after apply)

      + network_config (known after apply)

      + node_config {
          + disk_size_gb     = (known after apply)
          + disk_type        = (known after apply)
          + effective_taints = (known after apply)
          + image_type       = (known after apply)
          + labels           = (known after apply)
          + local_ssd_count  = (known after apply)
          + logging_variant  = (known after apply)
          + machine_type     = "e2-small"
          + metadata         = (known after apply)
          + min_cpu_platform = (known after apply)
          + oauth_scopes     = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible      = false
          + service_account  = "data-project-example-node-sa@data-project-example.iam.gserviceaccount.com"
          + spot             = false

          + confidential_nodes (known after apply)

          + gcfs_config (known after apply)

          + guest_accelerator (known after apply)

          + kubelet_config (known after apply)

          + shielded_instance_config (known after apply)

          + workload_metadata_config (known after apply)
        }

      + upgrade_settings (known after apply)
    }

  # google_service_account.nodes will be created
  + resource "google_service_account" "nodes" {
      + account_id   = "data-project-example-node-sa"
      + disabled     = false
      + display_name = "Cluster Nodes Service Account"
      + email        = "data-project-example-node-sa@data-project-example.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:data-project-example-node-sa@data-project-example.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "data-project-example"
      + unique_id    = (known after apply)
    }

  # google_service_account_iam_member.grant_sa_user will be created
  + resource "google_service_account_iam_member" "grant_sa_user" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "serviceAccount:hcp-terraform@data-project-example.iam.gserviceaccount.com"
      + role               = "roles/iam.serviceAccountUser"
      + service_account_id = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cluster_id   = (known after apply)
  + cluster_name = "data-project-example-cluster"
  + project      = "data-project-example"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

\`\`\`

</details>

*Pusher: @jolfr, Action: \`pull_request\`, Working Directory: \`infrastructure/cluster\`, Workflow: \`Pull Request\`*